Config/DataProcessors/ProcessFinishedResourceReservations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ProcessFinishedResourceReservations</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodToWait</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ProcessingDateTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FinishedResourceReservationStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ResourceReservationStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ResourceReservationStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ResourceReservationStatuses</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SortCode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsActive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsGuaranteed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoCharging</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DoNotChargeForecastServices</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServicesAreDelivered</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuaranteeType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuaranteeTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorHexString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/ProcessFinishedResourceReservations/Ext/ObjectModule.bsl
// -----------------------------------------------------------------------------
// Data processors framework start
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// -----------------------------------------------------------------------------
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	If PeriodToWait = 0 Then
		PeriodToWait = 1;
	EndIf;
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
	EndIf;
	// Try to find active resource reservation status with both "Do charging" and 
	// "Services are delivered" flags checked
	If Not ValueIsFilled(FinishedResourceReservationStatus) Then
		vQry = New Query();
		vQry.Text = 
		"SELECT TOP 1
		|	ResourceReservationStatuses.Ref
		|FROM
		|	Catalog.ResourceReservationStatuses AS ResourceReservationStatuses
		|WHERE
		|	(NOT ResourceReservationStatuses.DeletionMark)
		|	AND (NOT ResourceReservationStatuses.IsFolder)
		|	AND ResourceReservationStatuses.IsActive
		|	AND ResourceReservationStatuses.DoCharging
		|	AND ResourceReservationStatuses.ServicesAreDelivered";
		vStses = vQry.Execute().Unload();
		If vStses.Count() > 0 Then
			FinishedResourceReservationStatus = vStses.Get(0).Ref;
		EndIf;
	EndIf;
	// Set processing date time
	ProcessingDateTime = CurrentSessionDate() - PeriodToWait*3600;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
// Run data processor in silent mode
// -----------------------------------------------------------------------------
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	// Process finished resource reservations
	pmProcessFinishedResourceReservations(pIsInteractive);
EndProcedure // pmRun

// -----------------------------------------------------------------------------
// Data processors framework end
// -----------------------------------------------------------------------------
	
// -----------------------------------------------------------------------------
Procedure pmProcessFinishedResourceReservations(pIsInteractive = False) Export
	WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), Undefined, NStr("en='Start of processing';ru='Начало выполнения';de='Anfang der Ausführung'"));
	// Check parameters
	WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), FinishedResourceReservationStatus, NStr("en='Hotel: ';ru='Гостиница: ';de='Hotel: '") + TrimAll(Hotel));
	If Not ValueIsFilled(FinishedResourceReservationStatus) Then
		vMessage = NStr("ru='Не указан статус завершенной брони!';
		                |de='Der Status einer abgeschlossenen Reservierung ist nicht angegeben!';
						|en='Finished resource reservation status is not set!'");
		WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Warning, ThisObject.Metadata(), Undefined, vMessage);
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			Return;
		Else
			Raise vMessage;
		EndIf;
	Else
		WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), FinishedResourceReservationStatus, NStr("en='Finished resource reservation status: ';ru='Статус завершенной брони: ';de='Status der abgeschlossenen Reservierung: '") + TrimAll(FinishedResourceReservationStatus));
	EndIf;
	If Not ValueIsFilled(ProcessingDateTime) Then
		vMessage = NStr("ru='Не указана дата, на которую считать бронь завершенной!';
		                |de='Das Datum, an dem die Reservierung als abgeschlossen betrachtet werden kann, ist nicht angegeben!'; 
						|en='Finished resource reservation date is not set!'");
		WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Warning, ThisObject.Metadata(), Undefined, vMessage);
		If pIsInteractive Then
			tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			Return;
		Else
			Raise vMessage;
		EndIf;
	Else
		WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), Undefined, NStr("en='Finished resource reservation date and time: ';ru='Дата и время на которые считать бронь завершенной: ';de='Datum und Zeit, zu denen die Reservierung als abgeschlossen gelten kann: '") + Format(ProcessingDateTime, "DF='dd.MM.yyyy HH:mm'"));
	EndIf;
	// Get list of resource reservations to process
	vQry = New Query();
	vQry.Text = 
	"SELECT DISTINCT
	|	ResourceReservations.Ref AS ResourceReservation,
	|	ResourceReservations.Ref.PointInTime AS PointInTime
	|FROM
	|	Document.ResourceReservation AS ResourceReservations
	|WHERE
	|	ResourceReservations.Posted
	|	AND NOT ResourceReservations.ResourceReservationStatus.ServicesAreDelivered
	|	AND ResourceReservations.ResourceReservationStatus.IsActive
	|	AND ResourceReservations.Ref.DateTimeTo <= &qProcessingDateTime
	|	AND ResourceReservations.ResourceReservationStatus <> &qFinishedResourceReservationStatus
	|	AND (ResourceReservations.Hotel IN HIERARCHY (&qHotel)
	|			OR &qHotelIsEmpty)
	|
	|ORDER BY
	|	ResourceReservations.Ref.PointInTime";
	vQry.SetParameter("qProcessingDateTime", ProcessingDateTime);
	vQry.SetParameter("qFinishedResourceReservationStatus", FinishedResourceReservationStatus);
	vQry.SetParameter("qHotel", Hotel);
	vQry.SetParameter("qHotelIsEmpty", Not ValueIsFilled(Hotel));
	vReservations = vQry.Execute().Unload();
	// Change reservation status for each reservation and post it
	For Each vReservationsRow In vReservations Do
		Try
			vReservationObj = vReservationsRow.ResourceReservation.GetObject();
			If TypeOf(vReservationObj.Ref) <> Type("DocumentRef.ResourceReservation") Then
				Continue;
			EndIf;
			vReservationObj.ResourceReservationStatus = FinishedResourceReservationStatus;
			vReservationObj.DoCharging = FinishedResourceReservationStatus.DoCharging;
			vReservationObj.Write(DocumentWriteMode.Posting);
			// Save data to the document history
			vReservationObj.pmWriteToResourceReservationChangeHistory(CurrentSessionDate(), SessionParameters.CurrentUser);
			
			// Log current state
			vMessage = NStr("ru = 'Обработан документ: " + String(vReservationObj.Ref) + " - группа № " + TrimAll(vReservationObj.GuestGroup) + "'; 
			                |de = 'Document " + String(vReservationObj.Ref) + " - group N " + TrimAll(vReservationObj.GuestGroup) + " was processed'; 
			                |en = 'Document " + String(vReservationObj.Ref) + " - group N " + TrimAll(vReservationObj.GuestGroup) + " was processed'");
			WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), vReservationObj.Ref, vMessage);
			If pIsInteractive Then
				tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Information);
			Endif;
		Except
			vMessage = ErrorDescription();
			WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Warning, ThisObject.Metadata(), ?(vReservationObj = Undefined, Undefined, vReservationObj.Ref), vMessage);
			If pIsInteractive Then
				tcCommonFunctionOnClientServer.TextMessage(vMessage, MessageStatus.Attention);
			EndIf;
		EndTry;
	EndDo;
	WriteLogEvent(NStr("en='DataProcessor.ProcessFinishedResourceReservations';ru='Обработка.ОбработкаЗавершеннойБрониРесурсов';de='DataProcessor.ProcessFinishedResourceReservations'"), EventLogLevel.Information, ThisObject.Metadata(), Undefined, NStr("en='End of processing';ru='Конец выполнения';de='Ende des Ausführung'"));
EndProcedure // pmProcessFinishedResourceReservations
